const costMapping = {
    "不限": null,
    0 : "0",
    1 : "1",
    2 : "2",
    3 : "3",
    4 : "4",
    5 : "5",
    6 : "6",
    7 : "7",
    8 : "8",
    9 : "9",
    10 : "10+"
};

const cardClassMapping = {
    "不限": null,
    "战士": "WARRIOR",
    "法师": "MAGE",
    "猎人": "HUNTER",
    "牧师": "PRIEST",
    "盗贼": "ROGUE",
    "萨满": "SHAMAN",
    "术士": "WARLOCK",
    "德鲁伊": "DRUID",
    "圣骑士": "PALADIN",
    "死亡骑士": "DEATHKNIGHT",
    "恶魔猎手": "DEMONHUNTER",
    "中立": "NEUTRAL"
};

const cardSetMapping = {
    "不限": null,
    "怀旧系列": 1,
    "纳克萨玛斯": 2,
    "地精大战侏儒": 3,
    "黑石山的火焰": 4,
    "冠军的试炼": 5,
    "探险者协会": 6,
    "古神的低语": 7,
    "卡拉赞之夜": 8,
    "龙争虎斗加基森": 9,
    "勇闯安戈洛": 10,
    "冰封王座的骑士": 11,
    "狗头人与地下世界": 12,
    "女巫森林": 13,
    "砰砰计划": 14,
    "拉斯塔哈的大乱斗": 15,
    "暗影崛起": 16,
    "奥丹姆奇兵": 17,
    "巨龙降临": 18,
    "迦拉克隆的觉醒": 19,
    "恶魔猎手新兵": 20,
    "外域的灰烬": 21,
    "通灵学院": 22,
    "疯狂的暗月马戏团": 23,
    "贫瘠之地的锤炼": 24,
    "哀嚎洞穴": 25,
    "暴风城下的集结": 26,
    "死亡矿井": 27,
    "奥特兰克的决裂": 28,
    "奥妮克希亚的巢穴": 29,
    "探寻沉没之城": 30,
    "潮汐王座": 31,
    "纳斯利亚堡的悬案": 32,
    "混乱噬渊": 33,
    "巫妖王的进军": 34,
    "阿尔萨斯之路": 35,
    "重返纳克萨玛斯": 36,
    "传奇音乐节": 37,
    "音乐之劫": 38,
    "泰坦诸神": 39,
    "时光之穴": 40,
    "奥杜尔的陷落": 41,
    "决战荒芜之地": 42,
    "核心系列2024": 43,
    "礼物系列": 44,
    "威兹班的工坊": 45,
    "深入深岩之洲": 46,
    "胜地历险记": 47
};

const type = {
    "选择": null,
    "随从": "minion",
    "法术": "spell",
    "武器": "weapon",
    "英雄牌": "hero",
    "地标": "location",
    "英雄技能": "heroPower"
};

const attack = {
    "不限": null,
    0 : "0",
    1 : "1",
    2 : "2",
    3 : "3",
    4 : "4",
    5 : "5",
    6 : "6",
    7 : "7",
    8 : "8",
    9 : "9",
    10 : "10+"
};

const health = {
    "不限": null,
    0 : "0",
    1 : "1",
    2 : "2",
    3 : "3",
    4 : "4",
    5 : "5",
    6 : "6",
    7 : "7",
    8 : "8",
    9 : "9",
    10 : "10+"
};

const rarity = {
    "不限": null,
    "基本": "FREE",
    "普通": "COMMON",
    "稀有": "RARE",
    "史诗": "EPIC",
    "传说": "LEGENDARY"
};

const race = {
    "不限": null,
    "野兽": "BEAST",
    "恶魔": "DEMON",
    "龙": "DRAGON",
    "元素": "ELEMENT",
    "机械": "MECH",
    "鱼人": "MURLOC",
    "海盗": "PIRATE",
    "图腾": "TOTEM",
    "亡灵": "UNDEAD",
    "娜迦": "NAGA",
    "野猪人": "BOAR",
    "全部": "ALL"

};

const spellSchool = {
    "不限": null,
    "奥术": "ARCANE",
    "火焰": "FIRE",
    "冰霜": "FROST",
    "自然": "NATURE",
    "暗影": "SHADOW",
    "神圣": "HOLY",
    "邪能": "FEL"
};

const durability = {
    "不限": null,
    0 : "0",
    1 : "1",
    2 : "2",
    3 : "3",
    4 : "4",
    5 : "5",
    6 : "6",
    7 : "7",
    8 : "8",
    9 : "9",
    10 : "10+"
}

const armor = {
    "不限": null,
    0 : "0",
    1 : "1",
    2 : "2",
    3 : "3",
    4 : "4",
    5 : "5",
    6 : "6",
    7 : "7",
    8 : "8",
    9 : "9",
    10 : "10+"
};
export {costMapping, cardClassMapping, cardSetMapping,
    type, attack, health, rarity, race, spellSchool, durability, armor}